Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: The following example sets the value of the key “animal” in the playground key-value store to “Llama” and then sets theAnimal by getting the value of that key from the key-value store.
ja: 以下の例は、プレイグラウンドキー値保管庫の中のキー「animal」の値を「Llama」に設定します、それからそのキーの値をキー値保管庫から取得することでtheAnimalを設定します。

source: The following example shows a class extension that starts an assessment of the users' current progress and terminates the current playground when the always-on live view sends a message that it has finished the current task.
ja: 以下の例はあるクラス拡張を示します、それはユーザの現在の進捗の評価を開始して、常時接続のライブビューがメッセージを送る時、それが現在の作業を完了してしまったという時に現在のプレイグラウンドを終了します。

source: The following example shows a popover with the message “Great job!” The message string uses markup to display the word “Great” using bold font.
ja: 以下の例は、メッセージ「Great job!」をもつポップオーバーを表示します。メッセージ文字列はマークアップを使用して、単語「Great」を太字フォントを使って表示します。

source: The following source code creates a dark gray, edge-to-edge live view and adds a subview for the content.
ja: 以下のソースコードは、暗い灰色の、端から端までのライブビューを作成して、コンテンツのためのサブビューを加えます。

source: The format for the objects in this array is described in the section below.
ja: この配列の中のオブジェクトの書式は、下の節で説明されます。

source: The format of the string is:
ja: その文字列の書式は：

source: The formatted text for the hint shown in the popover.
ja: ポップオーバーにおいて現れるヒントのための書式設定されたテキスト。

source: The forward slash closes the delimiter.
ja: そのフォワードスラッシュが区切り記号を閉じます。

source: The icon must be an image with a 4:3 aspect ratio.
ja: アイコンは、縦横比4:3の画像でなければなりません。

source: The identifier follows the same syntax rules as a Swift identifier, and is scoped to the playground environment itself.
ja: 識別子は、Swift識別子と同じ構文規則に従います、そしてプレイグラウンド環境それ自身にスコープされます。

source: The identifier must match the ContentIdentifier Key in the book’s manifest and start with the feedIdentifier of the feed that contains this book.
ja: 識別子は、ブックの持つマニフェストの中のContentIdentifierキーに合致して、このブックを含んでいるフィードのfeedIdentifierで始まらなければなりません。

source: The image file can be in any Resources folder in the book.
ja: 画像ファイルは、ブックの中のどのResourcesフォルダの中にあっても構いません。

source: The image is a .png file in the book’s Resources folder.
ja: この画像は、ブックのResourcesフォルダの中の.pngファイルです。

source: The indentation of content within a multiline editable area must match that of its enclosing delimiters.
ja: 複数行編集エリアの内容の字下げは、それの閉じ区切り記号のそれと一致しなければなりません。

source: The inner view is set to fill the live view safe area.
ja: 内部ビューは、ライブビュー安全領域いっぱいに設定されます。

source: The instructions displayed when code is ready to be copied to the current playground page.
ja: コードがすでに現在のプレイグラウンドページにコピーされる場合に表示される指示書。

source: The instructions displayed when code isn’t ready to be copied to the current playground page, such as when a previous page has not been completed.
ja: コードがまだ現在のプレイグラウンドページにコピーされていない場合に表示される指示書、例えば前のページが完了していない時など。

source: The items in the array are other PlaygroundValue types.
ja: 配列の中の項目は、他のPlaygroundValue型です。

source: The key name for a term dictionary is the glossary term itself.
ja: ある用語ディクショナリのためのキー名は、グロッサリー用語それ自身です。

source: The key-value store is available only in Swift Playgrounds and is persistent only in playground books.
ja: キー値保管庫は、Swift Playgroundsだけで利用でき、プレイグラウンドブックにおいてのみ永続的です。

source: The keys in this table must be present at the top level of the JSON object that represents a feed.
ja: この表の中のキーは、あるフィードを表すJSONオブジェクトのトップレベルに存在しなければなりません。

source: The level must be "beginner", "intermediate", "expert", or "advanced".
ja: レベルは、"beginner"、"intermediate"、"expert"、または"advanced"でなければなりません。

source: The lines between the opening and closing comment delimiters can contain text, text and markup, or nothing.
ja: 開きと閉じコメント区切り記号の間の行は、テキスト、テキストとマークアップを含む、または何も含まないことができます。

source: The list of chapters in the book, in the order in which they appear in the table of contents.
ja: ブックの中の章のリスト、それらが目次に現れる順序で。

source: The list of pages in a chapter, in the order in which they appear in the table of contents.
ja: ある章の中のベージのリスト、それらが目次に現れる順番で。

source: The list of possible completions is the result of evaluating all of the code-completion delimiters above the current insertion point.
ja: 可能な補完のリストは、現在の挿入点より上のすべてのコード補完区切り記号を評価した結果です。

source: The live view can be opened from any source file and runs only while the playground is executing.
ja: ライブビューは、どんなソースファイルからでも開かれることができ、プレイグラウンドが実行されている間のみ動作します。

source: The live view is displayed in the live view pane for the current playground page.
ja: ライブビューは、現在のプレイグラウンドページのためのライブビューペーンにおいて表示されます。

source: The main playground page uses a PlaygroundRemoteLiveViewProxy downcast of the current always-on live view for exchanging messages.
ja: メインプレイグラウンドページは、現在の常時接続ライブビューのPlaygroundRemoteLiveViewProxyダウンキャウトをメッセージのやり取りのために使います。

source: The markup in the hint string displays the word “for” in code voice.
ja: ヒント文字列の中のマークアップは、単語「for」をコード調で表示します。

source: The message argument can contain markup.
ja: メッセージ引数は、マークアップを含むことができます。

source: The minimum version of Swift Playgrounds that is required for using the book.
ja: このブックを使うために必要とされるSwift Playgroundsの最小バージョン。

source: The minimum version of iOS required for the book.
ja: このブックに必要とされる最小限のiOSのバージョン番号。

source: The minimum version of iOS that can use your playground book.
ja: あなたのプレイグラウンドブックを使うことができる最小限のバージョンのiOS。

source: The minimum version of the Swift Playgrounds app that the playground book uses.
ja: プレイグラウンドブックが使うSwift Playgroundsアプリの最小限のバージョン。

source: The multiline editable area is defined on lines 3 to 5 of Listing 7-5.
ja: 複数行編集エリアは、コード出力 7-5の行３-５で定義されます。

source: The multiline editable area is defined on lines 6 and 7.
ja: 複数行編集エリアは、行６と７で定義されます。

source: The name displayed in the user interface.
ja: ユーザインターフェイスにおいて表示される名前。

source: The name is also used as part of the link to the first use of a glossary term.
ja: 名前はまた、ある語彙集用語の最初の利用に対するリンクの一部として使われます。

source: The name of a peripheral as it should appear in a connection view.
ja: 接続機器の名前、接続ビューにおいてそれが現れるはずの通りに。

source: The name of each chapter is taken from the value of the Name key in the chapter manifest file.
ja: 各章の名前は、章マニフェストファイルの中のNameキーの値から取られます。

source: The name of each page is the value of the Name key in the manifest file for the playground page or cutscene page.
ja: 各ページの名前は、プレイグラウンドページまたはカットシーンページのためのマニフェストファイルの中のNameキーの値です。

source: The name of the concept described by the term dictionary.
ja: 用語ディクショナリによって記述される概念の名前。

source: The name of the image used for the book icon in Swift Playgrounds.
ja: Swift Playgroundsにおいてブックアイコンに使われる画像の名前。

source: The name of the key for the dictionary is used as the display name for the term in the full glossary and in the glossary term popover.
ja: ディクショナリのためのキーの名前は、完全なグロッサリーにおけるそしてグロッサリー用語ポップオーバーにおける用語のディスプレイ名が使われます。

source: The name of the playground book.
ja: プレイグラウンドブックの名前。

source: The name of your subscription.
ja: あなたのサブスクリプションの名前。

source: The newly connected peripheral.
ja: 新しく接続された周辺機器。

source: The newly discovered peripheral.
ja: 新しく発見された周辺機器。

source: The newly-discovered peripheral.
ja: 新しく発見された周辺機器。

source: The next argument is the action to take: adding symbols (show) or removing symbols (hide) from the list of possible code completions.
ja: 次の引数は、取るべきアクション：可能なコード補完のリストからのシンボルの追加（show）またはシンボルの削除（hide）です。

source: The opening and closing delimiters are preceded by a forward slash, an asterisk, a pound sign, and a hyphen (/*#-).
ja: 開きおよび閉じ区切り記号は、１つのフォワードスラッシュ文字、アスタリスク、ポンド記号、そしてハイフン（/*#-）を前に置かれます。

source: The opening and closing delimiters are preceded by two forward slash characters followed by a pound sign and a hyphen (//#-) and appear on a separate line.
ja: 開きおよび閉じ区切り記号は、２つのフォワードスラッシュ文字とそれに続くポンド記号とハイフン（//#-）を前に置いて個別の行に現れます。

source: The opening and closing delimiters are preceded by two forward slash characters, a pound sign, and a hyphen (//#-) and appear on a separate line.
ja: 開きおよび閉じ区切り記号は、２つのフォワードスラッシュ文字、ポンド記号、そしてハイフン（//#-）を前に置いて個別の行に現れます。

source: The optional placeholder text is shown when the editable area is empty.
ja: 任意のプレースホルダーテキストは、編集エリアが空の時に表示されます。

source: The optional glossary property list contains key-value pairs defining the terms for the glossary of a book.
ja: 随意であるグロッサリープロパティリストは、あるブックのグロッサリーのための用語を定義するキー値ペアを含んでいます。

source: The optional hints property list contains an array of dictionaries with information about each hint.
ja: 任意のヒントプロパティリストは、各ヒントについての情報を持つディクショナリからなるある配列を含みます。

source: The optional type in a token is a valid Swift type, which can be a custom type.
ja: あるトークンでの任意の型は、有効なSwift型です、それはカスタム型であることが出来ます。

source: The order of items in the Pages array defines the order of the pages in the chapter.
ja: Pages配列の中の用語の順序は、その章の中のページの順序を定義します。

source: The order of the items in the Chapters array defines the order of the chapters in the book.
ja: Chapters配列の中の項目の順番は、ブックの章の順番を定義します。

source: The organization publishing the subscription.
ja: サブスクリプションを出版している組織。

source: The other type is a placeholder token that is added to the editable area; for more information, see Placeholder Tokens.
ja: もう一方の種類はプレースホルダートークンです、それは編集エリアに追加されます；さらなる情報は、プレースホルダートークンを見てください。

source: The package format uses a combination of folder name extensions, specially named folders, and specially named files.
ja: このパーケージ形式は、フォルダ名拡張子、特有名前フォルダ、そして特有名前ファイルの組み合わせを使います。

source: The package structure consists of specially named folders with no folder name extensions.
ja: パッケージ構造は、名前拡張子を持たない特有名前フォルダから成ります。

source: The page annotation delimiters for the two types of editable fields are the same, but the comment delimiters are different.
ja: この２つのタイプの編集フィールドに対するページ注釈区切り記号は同じです、しかしコメント区切り記号は異なります。

source: The page on the right side of the figure uses a value of HiddenByDefault.
ja: 図の右側でのページはHiddenByDefaultの値を使います。

source: The page on the right side of the figure uses a value of YEStrue.
ja: 図の右側でのページはYEStrueの値を使います。

source: The parts of a book package form a nested hierarchy of folders.
ja: ブックパッケージの各部分は、入れ子のフォルダ階層を形成します。

source: The path follows URI rules for encoding spaces and other special characters.
ja: パスは、空白と他の特殊文字をエンコーディングするためのURIルールに従います。

source: The path to the page that contains the first use of the glossary term.
ja: グロッサリー用語の最初の使用を含むページへのパス。

source: The path to the page where the term is first used.
ja: 用語が最初に使われるところのページへのバス。

source: The peripheral corresponding to the PlaygroundBluetoothConnectionView.Item being displayed.
ja: 表示されているPlaygroundBluetoothConnectionView.Itemに対応している周辺機器。

source: The peripheral corresponding to the battery level being displayed.
ja: 表示されているバッテリレベルに関連付いた周辺機器。

source: The peripheral corresponding to the firmware readiness being set.
ja: 設定される準備が整っているファームウェアに関連する周辺機器。

source: The peripheral corresponding to the icon being displayed.
ja: 表示されているアイコンに対応している周辺機器。

source: The peripheral corresponding to the name.
ja: その名前に対応する周辺機器。

source: The peripheral facing emminent disconnection.
ja: 差し迫った切断に直面している周辺機器。

source: The peripheral is in the process of connecting to a connection view’s central manager.
ja: この周辺機器は、ある接続ビューの持つセントラルマネージャへの接続処理中です。

source: The peripheral that the central manager couldn’t connect to.
ja: セントラルマネージャがそれに対して接続できなかった周辺機器。

source: The peripheral that the central manager disconnected from.
ja: セントラルマネージャがそれから切断された周辺機器。

source: The peripheral that the central manager is attempting to connect to.
ja: セントラルマネージャがそれに接続しようと試みている周辺機器。

source: The peripheral to attempt to connect to.
ja: この周辺機器に接続を試みます。

source: The peripheral to disconnect from the central manager.
ja: セントラルマネージャから切断する周辺機器。

source: The peripheral to display in the connection view.
ja: 接続ビューにおいて表示する周辺機器。

source: The placeholder shows the words “number of repetitions”.
ja: プレースホルダーは語「number of repetitions」を示します。

source: The playground book format version.
ja: プレイグラウンドブック形式バージョン。

source: The playground page on the left side of the figure uses a value of NOfalse.
ja: 図の左側でのプレイグラウンドページはNOfalseの値を使います。

source: The playground page on the left side of the figure uses a value of VisibleByDefault.
ja: 図の左側でのプレイグラウンドページは、VisibleByDefaultの値を使います。

source: The popover with the glossary term definition is shown after the user taps the link.
ja: グロッサリー用語定義を持つポップオーバーは、ユーザがリンクをタップ後に示されます。

source: The possible values for LiveViewMode are:
ja: LiveViewModeに対して可能な値は：

source: The possible values for PlaygroundLoggingMode are:
ja: PlaygroundLoggingModeに対して可能な値は：

source: The problematic peripheral.
ja: 問題のある周辺機器。

source: The property list file is called Glossary.plist and is located in the PrivateResources folder of the book at the path:
ja: プロパティリストファイルは、Glossary.plistと呼ばれます、そしてブックのPrivateResourcesフォルダに以下のパスで位置します：

source: The property list file is called Hints.plist and is located in the PrivateResources folder of a page at the following path:
ja: そのプロパティリストはHints.plistと呼ばれ、以下のバスでのページのPrivateResourcesフォルダに位置します：

source: The protocol you adopt to display an available peripheral in a playground page’s connection view.
ja: ある利用可能な周辺機器をプレイグラウンドページの接続ビューにおいて表示するためにあなたが採用するプロトコル。

source: The recommended format is a reverse DNS string starting with your company or personal identifier followed by a name for the book.
ja: 推奨される形式は、逆DNS文字列で、あなたの会社または個人識別子で始まり、後にブックの名前が続くものです。

source: The recommended image size is 400 by 300 pixels.
ja: 推奨される画像サイズは、400 × 300 ビクセルです。

source: The rest of the method parses the command and takes appropriate action.
ja: メソッドの残りは、コマンドを構文解析して適切なアクションを起こします。

source: The rest of the page is read-only.
ja: ベージの残りは読み出し専用です。

source: The returned value is of type PlaygroundValue Enumeration.
ja: 返される値は、型PlaygroundValue列挙です。

source: The same expectation applies to the feeds distributing your playground subscriptions.
ja: 同じ予想が、あなたのプレイグラウンドサブスクリプションを配給しているフィードにも当てはまります。

source: The screenshot below shows the result of running the code in a playground page with LiveViewEdgeToEdge set to true.
ja: 下のスクリーンショットは、LiveViewEdgeToEdgeをtrueに設定するあるプレイグラウンドページの中のコードを実行する結果です。

source: The sections below describe the fields used in a subscription’s feed.
ja: 下の節は、サブスクリプションの持つフィードにおいて使われるフィールドを説明します。

source: The shortcut bar is configured to show only four methods instead of all possible completions, such as public symbols from the Swift standard library or public symbols from the current module.
ja: ショートカットバーは、可能な補完すべてではなく４つのメソッドだけ表示するよう構成されます、例えばSwift標準ライブラリからのパブリックシンボルまたは現在のモジュールからのパプリックシンボルなど。

source: The source page copies code only when assessmentStatus is set to .pass.
ja: ソースページは、コードをassessmentStatusが.passに設定される場合にのみコピーします。

source: The source page name is enclosed by quotation marks and matches the file path of a previous page in the playground book; the identifier matches an identifier in the named page specified by a copy-source delimiter.
ja: ソースページ名は、引用符記号で囲まれます、そしてプレイグラウンドブックの中の前のページのファイルパスと一致します；識別子はcopy-source区切り記号によって指定される名前付きページの中の識別子と一致します。

source: The space character in Issuing Commands, the name of the playground page, is encoded with the string %20.
ja: プレイグラウンドページの名前、Issuing Commandsの中の空白文字は、文字列%20でエンコードされます。

source: The state is one of the cases of the PlaygroundBluetoothConnectionView.State enumeration.
ja: 状態は、PlaygroundBluetoothConnectionView.State列挙のケース節の１つです。

source: The state of the view.
ja: ビューの状態。

source: The state that indicates that a peripheral doesn’t need a firmware update.
ja: この状態は、ある周辺機器がファームウェアアップデートを必要としないことを示します。

source: The state that indicates that a peripheral needs a firmware update before it can operate correctly.
ja: この状態は、ある周辺機器がファームウェアアップデートを、それが正しく操作されるには必要とすることを示します。

source: The states that tell users how to proceed when connecting to and switching between peripherals in a playground page.
ja: 接続および周辺機器間の切り替えの際に、どのように続けるべきかをプレイグラウンドページにおいてユーザに教える、いくつかの状態。

source: The strings for the solution and for hints can contain markup.
ja: 解答およびヒントの文字列は、マークアップを含むことができます。

source: The subtitle of the playground book displayed in detail views.
ja: 詳細ビューにおいて表示されるプレイグラウンドブックのサブタイトル。

source: The subtitle of the playground book displayed in overviews.
ja: 概要において表示されるプレイグラウンドブックのサブタイトル。

source: The suggested workflow is:
ja: お勧めするワークフローは：

source: The table of contents for the chapter displays only the pages listed in this array.
ja: その章のための目次は、この配列の中に列記されるページのみを表示します。

source: The table of contents for the playground book displays only the chapters listed in this array.
ja: プレイグラウンドブックのための目次は、この配列の中に列記される章だけを表示します。

source: The term key follows URI rules for encoding spaces and other special characters.
ja: 用語キーは、空白と他の特殊文字をエンコーディングするためのURIルールに従います。

source: The text for the hint shown in the popover.
ja: ポップオーバーにおいて表示されるヒントのためのテキスト。

source: The text is formatted using markup, and no special comment delimiters are required.
ja: テキストはマークアップを使って書式設定され、特別なコメント区切り記号は必要とされません。

source: The text to show when the code is ready to be copied to the current page.
ja: コードがすでに現在のページにコピーされる場合に表示されるテキスト。

source: The text to show when the code isn’t ready to be copied to the current page.
ja: コードがまだ現在のページにコピーされない場合に表示されるテキスト。

source: The title displayed for the first-use link in the full glossary.
ja: 完全なグロッサリーにおいて「使い始め」リンクに対して表示されるタイトル。

source: The title for a spoiler button.
ja: スポイラーボタンのタイトル。

source: The title for the copy command button.
ja: コピーコマンドボタンのためのタイトル。

source: The title for the default command button.
ja: 省略時のコマンドボタンのためのタイトル。

source: The title for the navigate command button.
ja: 誘導コマンドボタンのためのタイトル。

source: The title of the button used to copy the code to the current playground page.
ja: コードを現在のプレイグラウンドページにコピーするために使われるボタンのタイトル。

source: The title of the button used to copy the default code to the current playground page.
ja: 省略時のコードを現在のプレイグラウンドページにコピーするために使われるボタンのタイトル。

source: The title of the button used to navigate back to the playground page from which the code is copied.
ja: そこからコードがコピーされるプレイグラウンドへ戻るのを誘導するために使われるボタンのタイトル。

source: The title shown in the glossary as the first-use link.
ja: グロッサリーにおいて「使い始め」リンクとして表示されるタイトル。

source: The title used for the glossary term.
ja: グロッサリー用語のために使われるタイトル。

source: The top-level .playgroundbook folder
ja: 最上位の.playgroundbookフォルダ

source: The top-level folder for the playground book
ja: そのplaygroundブックの最上位のフォルダ

source: The type must be "string" or "date".
ja: 型は、"string"または"date"でなければなりません。

source: The type of the value specified by the value field.
ja: 値フィールドによって指定される値の型。

source: The unique identifier of the peripheral to attempt to connect to.
ja: それに接続を試みることになる周辺機器の固有識別子。

source: The user can edit the assignment statement defined on line 4 because it’s inside the editable area.
ja: ユーザは行４で定義される代入文を編集することが、それが編集エリアの内側であるので可能です。

source: The user can tap the result to view the value, and then can add an inline result viewer.
ja: ユーザは結果をタップすることで値を見ることができます、そしてそれからインライン結果ビューアに加えることができます。

source: The user has access to symbols in UKit and PlaygroundSupport, even though the import statements are hidden.
ja: ユーザは、UKitとPlaygroundSupportでのシンボルにアクセスします、import文が隠されているとしてもです。

source: The user opens the glossary by tapping Glossary in the Tools menu as shown in Figure 12-1.
ja: ユーザは、図 12-1で示されるようにToolsメニューのGlossaryをタップすることによってグロッサリーを開きます。

source: The user-facing name of the specified peripheral.
ja: 指定の周辺機器のユーザ向けの名前。

source: The value associated with key if key is in the key-value store; otherwise, nil.
ja: keyがキー値保管庫の中にあるならばkeyと結び付けられた値；そうでなければ、nil。

source: The value contains only numbers and periods (.).
ja: この値は、数字とピリオド（.）だけを含みます。

source: The value returned by playgroundLiveViewRepresentation can be different each time the method is called.
ja: playgroundLiveViewRepresentationによって返される値は、このメソッドが呼び出されるたびごとに異なる可能性があります。

source: The values for keys are other PlaygroundValue types.
ja: キーのための値は、他のPlaygroundValue型です。

source: The version must match the ContentVersion Key in the book’s manifest.
ja: バージョンナンバーは、ブックの持つマニフェストの中のContentVersionキーに合致しなければなりません。

source: The version number must be at least 10.0.
ja: バージョン番号は、少なとも10.0である必要があります。

source: The version of Swift that the playground book uses.
ja: プレイグラウンドブックが使うSwiftのバージョン。

source: The version of the feed format to which this feed conforms.
ja: このフィードが準拠するフィード書式のバージョン。

source: The version of the playground book format.
ja: プレイグラウンドブック形式のバージョン。

source: The view controller or view used to render and manage the live view.
ja: ライブビューを描画して管理するために使われるビューコントローラまたはビュー。

source: There can be only one live view open at any time.
ja: ライブビューはいつでもただ１つしか存在しません。

source: There is no limit to the number of lines in a comment.
ja: あるコメントの中の行数に限界はありません。

source: These URLs should match up with the URLs in the feed JSON.
ja: これらのURLは、フィードJSONの中のURLと調和しなければなりません。

source: These annotations do not show on the rendered playground pages.
ja: これらの注釈は、描画されたプレイグラウンドページ上では表示されません。

source: These arguments are enclosed by parentheses and delimited by a comma.
ja: これらの引数は、丸括弧で囲まれて、今まで区切られます。

source: These buttons overlay the live view.
ja: それらのボタンはライブビューにオーバーレイします。

source: These folders contain the book, the chapters in the book, and the pages in each chapter.
ja: これらのフォルダは、ブック、そのブックの中の章、そして章の中のいくらかのページを含みます。

source: They consist of metadata, like "What's the name of this feed?", and a primary list of homogeneous data items.
ja: それらは、「このフィードの名前は何か？」のようなメタデータ、そして同種のデータ項目からなる１つの主となるリストから成ります。

source: They link to, but do not contain, some media of interest (such as a link to an audio file, a blog post, or a playground).
ja: それらは、幾つかの興味深いメディアへリンクします、しかし含んでいるわけではありません（例えば音声ファイル、ブログ投稿、またはプレイグラウンドへのリンク）。

source: This appendix contains information about the frameworks available in playground books.
ja: この付録は、プレイグラウンドブックで利用可能なフレームワークについての情報を含みます。

source: This chapter describes the process of creating and hosting the subscription data you need to start publishing your playgrounds so people can subscribe to them in Swift Playgrounds.
ja: この章は、あなたの幾つかのプレイグラウンドの出版を開始して人々がそれらをSwift Playgroundsの中で購読（受信）できるようにするため、あなたが必要とするサブスクリプションデータを作成およびホストする過程を解説します。

source: This error doesn’t occur when a connection to the central manager is intentionally disconnected.
ja: このエラーは、セントラルマネージャへの接続が故意に切断される場合には起こりません。

source: This example shows a feed with two playground books that make up the whole series.
ja: この例は、そのシリーズ全体を作り上げる２つのプレイグラウンドを持つフィードを示します。

source: This example shows setting the proxy for a live view to a MyPlaygroundPageManager object.
ja: この例は、あるライブビューに対するプロキシをMyPlaygroundPageManagerオブジェクトに設定することを示します。

source: This framework has two primary classes, PlaygroundBluetoothCentralManager and PlaygroundBluetoothConnectionView, along with their supporting types.
ja: このフレームワークは２つの主要クラスPlaygroundBluetoothCentralManagerとPlaygroundBluetoothConnectionView、加えてそれらのサポートするいくつかの型を持ちます。

source: This information is displayed alongside the book’s preview images to provide details about the book—such as available localizations—before a user downloads it.
ja: この情報はブックのプレビュー画像に並んで表示されてブックについての詳細—利用可能な現地語化など—を、利用者がそれをダウンロードする前に提供します。

source: This is the part of the live view that is not covered by any Swift Playgrounds user interface elements, such as the Run button.
ja: これはどんなSwift Playgroundsユーザインターフェイスによってもカバーされないライブビュー部分です、例えばRun buttonなど。

source: This key-based subscript returns the value for the given key if the key is found in the key-value store, or nil if the key is not found.
ja: このキーに基づく添え字は、キーがキー値保管庫で見つけられるならば指定されたキーに対する値を、またはキーが見つけられないならば、nilを返します。

source: This method cannot be overridden.
ja: このメソッドはオーバーライドされることができません。

source: This protocol enables a live view to receive messages from a playground page.
ja: このプロトコルは、ライブビューにプレイグラウンドページからメッセージを受け取ることを可能にします。

source: This protocol enables an object to become the delegate of a PlaygroundRemoteLiveViewProxy Class object.
ja: このプロトコルは、あるオブジェクトにPlaygroundRemoteLiveViewProxyクラスオブジェクトの委任先になる能力を与えます。

source: This protocol enables you to display any type of object in a live view.
ja: このプロトコルは、あなたにどんな型のオブジェクトでもライブビューにおいて表示可能にします。
